app/controllers/articles_controller.rb

UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "asdfsadfasdffsdgsd\r\nfgs\r\ndfg\r\nsd\r\nfg\r\ns\r\ndf\r\ngsdfg"], ["updated_at", "2021-06-14 16:53:11.632034"], ["id", 1]]
---
	def update
		respond_to do |format|
      if @article.update(article_params)

INSERT INTO "articles" ("user_id", "title", "description", "slug", "content", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
    @article = current_user.articles.build(article_params)
    respond_to do |format|
      if @article.save