app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])
		@article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commentable_type", "commentable_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commentable_type", "Article"], ["commentable_id", 1], ["body", "sdfasdfsdf"], ["created_at", "2021-06-15 17:49:25.588316"], ["updated_at", "2021-06-15 17:49:25.588316"]]