app/controllers/visitors_controller.rb

SELECT "articles".* FROM "articles"
---
  def blogs
	@collection = Article.all